Revit 2026 API

# AnalysisMode Enumeration

---

This enum is used to define the Energy Analysis Model.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalysisMode
```
```vb
Public Enumeration AnalysisMode
```
```cpp
public enum class AnalysisMode
```
```fsharp
type AnalysisMode
```

| Member name | Value | Description |
| --- | --- | --- |
| BuildingElements | 0 | Energy Analysis Model based on building elements. |
| ConceptualMassesAndBuildingElements | 2 | Energy Analysis Model based on conceptual masses and building elements. |
| RoomsOrSpaces | 3 | Energy Analysis Model based on spatial elements. This mode uses volumes based on rooms or spaces defined in the building model. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace